app/Controllers/Booking.php

SELECT *
FROM `pesanan`
WHERE `pesanan`.`id_pesanan` = '1'
SELECT *
FROM `layanan`
SELECT *
FROM `barber`
UPDATE `pesanan` SET `id_layanan` = '2', `id_barber` = '2', `tanggal` = '2024-06-12', `jam_mulai` = '21:12', `estimasi_berakhir` = '21:24'
WHERE `pesanan`.`id_pesanan` IN ('1')
---
    public function edit($id_pesanan)
    {
        $booking = $this->M_pesanan->find($id_pesanan);
        $layanan = $this->M_Layanan->findAll();
        $barber = $this->M_Barber->findAll();

        if (!$booking) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException();
        }

        $id_layanan = $this->request->getPost('id_layanan');
        $id_barber = $this->request->getPost('id_barber');
        $tanggal = $this->request->getPost('tanggal');
        $jam_mulai = $this->request->getPost('jam_mulai');
        $estimasi_berakhir = $this->request->getPost('estimasi_berakhir');

        if (empty($id_layanan) || empty($id_barber) || empty($tanggal) || empty($jam_mulai) || empty($estimasi_berakhir)) {
            session()->setFlashdata('error', 'Semua field harus diisi');
            return redirect()->to(base_url() . '/tukangcukur/booking/tampil/edit/' . $id_pesanan);
        }

        $data = [
            'id_layanan' => $id_layanan,
            'id_barber' => $id_barber,
            'tanggal' => $tanggal,
            'jam_mulai' => $jam_mulai,
            'estimasi_berakhir' => $estimasi_berakhir,
        ];

        $this->M_pesanan->update($id_pesanan, $data);