app/Controllers/BookingView.php

    public function index()
    {
        $data = [
            'booking' => $this->M_pesanan->join('layanan', 'pesanan.id_layanan = layanan.id_layanan')
                ->join('barber', 'pesanan.id_barber = barber.id_barber')
                ->join('pelanggan', 'pesanan.id_pelanggan = pelanggan.id_pelanggan')
                ->select('pesanan.*, layanan.jenis_layanan, barber.nama as barber_name, pelanggan.nama as pelanggan_name')
                ->findAll(),
        ];
---
SELECT `pesanan`.*, `layanan`.`jenis_layanan`, `barber`.`nama` as `barber_name`, `pelanggan`.`nama` as `pelanggan_name`
FROM `pesanan`
JOIN `layanan` ON `pesanan`.`id_layanan` = `layanan`.`id_layanan`
JOIN `barber` ON `pesanan`.`id_barber` = `barber`.`id_barber`
JOIN `pelanggan` ON `pesanan`.`id_pelanggan` = `pelanggan`.`id_pelanggan`

    public function edit($id_pesanan)
    {
        $booking = $this->M_pesanan->find($id_pesanan);
        $layanan = $this->M_Layanan->findAll();
        $barber = $this->M_Barber->findAll();
---
SELECT *
FROM `pesanan`
WHERE `pesanan`.`id_pesanan` = '1'
SELECT *
FROM `layanan`
SELECT *
FROM `barber`